Задача 2.
Кто делает: Расюк, Рябов, Дынник, Трофимова

Сенсация! Известный специалист по UFO профессор Персиков получил послание от внеземного разума. Во всяком случае он так считает. Послание представляет собой непрерывную последовательность из сигналов нескольких типов, каждый из этих типов для определенности можно обозначить малой буквой латинского алфавита. Профессор считает, что доказательством искусственности происхождения сигнала служит его периодичность. При этом период должен быть строго равен «константе Персикова» — числу P. Такую последовательность назовем P — периодичной.

К сожалению, некоторые сигналы из-за прохождения сквозь бездны пространства (а может даже и времени) были утеряны. Их заменили на знак вопроса. Теперь профессору для дальнейшей работы требуется выяснить, можно ли как-то заменить утерянные сигналы на буквы так, чтобы последовательность стала P — периодичной. Для чистоты эксперимента полученная из космоса последовательность была размещена среди себе подобных. Не подведите, в ваших руках — будущее межгалактических взаимоотношений!

Формат входных данных

В первой строке содержится два числа через пробел: N — общее количество строк, которые вам нужно проверить на P-периодичность и число P — константа Персикова (1 <= P <= 510^3). Далее содержится N непустых строк, состоящих из малых букв латиницы и знаков вопроса. 1 <= N <= 510^4 , суммарная длина всех строк не превосходит 2*10^5.

Формат выходных данных

Вывести N строк, в каждой из которых вывести либо «YES», если соответствующую строку можно сделать P-периодичной путем замены всех знаков вопроса на некоторые буквы, и «NO» в противном случае. Будем считать последовательность P-периодичной, если для любых двух символов, расстояние между которыми кратно P верно, что они совпадают.

In [ ]:
def ufo(s,p):
  for a in range(0,len(s)-p):
    if (s[a]!=s[a+p])&(s[a]!='?')&(s[a+p]!='?'):
      return 'NO'
  return 'YES'
  

n=int(input())
p=int(input())
l=[]
for i in range(0,n):
  m=input()
  an=ufo(m,p)
  l.append(an)
for i in range(0,n):
  print(l[i])

3
3
???
abc??c
aaa?aaaaa
YES
YES
YES

Задача 4. Общая задача.
Можно ли узнать возраст клиента на основе информации о его расходах по карте? Мы подготовили задачу на базе реальных банковских транзакций. Совершенствуя свои продукты, банк использует информацию о пользователях, в том числе и возраст. Это помогает сделать персонализированные продукты, которые удовлетворяют реальные потребности клиентов. Но всегда ли календарный возраст соответствует образу жизни (и покупок) человека?

Ваша задача — по информации о расходах клиента банка предсказать, в какую из возрастных групп он попадает. Даны обучающие train данные для построения признаков и обучения моделей, и тестовые test данные для проверки алгоритмов. Это специальным образом подготовленная и анонимизированная информация, на которой можно обучать модели, сохраняя полную безопасность реальных данных клиентов. Решением задачи являются предсказания алгоритмов на тестовых данных. Чем меньше ошибок совершит ваш алгоритм, тем выше вы поднимитесь в рейтинге!

Данные

Для решения задачи участникам предоставляется информация о транзакциях клиентов банка. Объемом около 27000000 миллионов записей. Каждая запись описывает одну банковскую транзакцию. Для каждого из ≈ 20000 тестовых id, участникам необходимо с помощью обученной модели предсказать, в какую из возрастных групп попадает Клиент.

Подготовлено два набора данных:

Обучающий transactions_train.csv, в котором для каждой транзакции известна дата, сумма, тип и id клиента;
Тестовый transactions_test.csv, содержащий те же поля:
сlient_id – уникальный номер клиента;
trans_date – дата транзакции (представляет из себя просто номер дня в хронологическом порядке, начиная от заданной даты);
small_group – группа транзакций, характеризующих тип транзакции (например, продуктовые магазины, одежда, заправки, детские товары и т.п.);
amount_rur – сумма транзакции (для анонимизации данные суммы были трансформированы без потери структуры).
На базе данных файлов можно строить различные признаки, которые характеризуют возрастные группы.

Целевая переменная для обучающего датасета находится в файле train_target.csv.

В нем содержится информация о Клиенте и метка возрастной группы, к которой он относится:

client_id – уникальный номер Клиента (соответствует client_id и файла transactions_train.csv);
bins – метка возраста. В файлe test.csv вам надо предсказать для указанных client_id соответствующую метку группы возраста.
Участникам также предоставлен информационный файл small_group_description.csv, который содержит расшифровку типов транзакций.

Наборы данных и базовое решени: https://drive.google.com/drive/folders/1y0Ua0pO9Fo6iWfa-yoJ8KvUhPXUbUafF?usp=sharing

In [ ]:
import pandas as pd

In [ ]:
df1=pd.read_csv('/content/drive/MyDrive/transactions_train.csv')

In [ ]:
name=pd.read_csv('/content/drive/MyDrive/train_target.csv')

In [ ]:
df1

          client_id  trans_date  small_group  amount_rur
0             33172           6            4      71.463
1             33172           6           35      45.017
2             33172           8           11      13.887
3             33172           9           11      15.983
4             33172          10           11      21.341
...             ...         ...          ...         ...
26450572      43300         727           25       7.602
26450573      43300         727           15       3.709
26450574      43300         727            1       6.448
26450575      43300         727           11      24.669
26450576      43300         729            3      19.408

[26450577 rows x 4 columns]

In [ ]:
df1.info

<bound method DataFrame.info of           client_id  trans_date  small_group  amount_rur
0             33172           6            4      71.463
1             33172           6           35      45.017
2             33172           8           11      13.887
3             33172           9           11      15.983
4             33172          10           11      21.341
...             ...         ...          ...         ...
26450572      43300         727           25       7.602
26450573      43300         727           15       3.709
26450574      43300         727            1       6.448
26450575      43300         727           11      24.669
26450576      43300         729            3      19.408

[26450577 rows x 4 columns]>

In [ ]:
df1.isna().sum()

client_id      0
trans_date     0
small_group    0
amount_rur     0
dtype: int64

In [ ]:
df=pd.merge(df1,name,on='client_id')

In [ ]:
df

          client_id  trans_date  small_group  amount_rur  bins
0             33172           6            4      71.463     0
1             33172           6           35      45.017     0
2             33172           8           11      13.887     0
3             33172           9           11      15.983     0
4             33172          10           11      21.341     0
...             ...         ...          ...         ...   ...
26450572      43300         727           25       7.602     2
26450573      43300         727           15       3.709     2
26450574      43300         727            1       6.448     2
26450575      43300         727           11      24.669     2
26450576      43300         729            3      19.408     2

[26450577 rows x 5 columns]

In [ ]:
import xgboost as xgb

In [ ]:
X=df.drop(['bins','client_id'],axis='columns')
y=df.bins

In [ ]:
model=xgb.XGBClassifier(objective='multi:softprob',num_class=4,n_jobs=4,seed=42,n_estimators=300)
model.fit(X[:10000],y[:10000])

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0,
              learning_rate=0.1, max_delta_step=0, max_depth=3,
              min_child_weight=1, missing=None, n_estimators=300, n_jobs=4,
              nthread=None, num_class=4, objective='multi:softprob',
              random_state=0, reg_alpha=0, reg_lambda=1, scale_pos_weight=1,
              seed=42, silent=None, subsample=1, verbosity=1)

In [ ]:
test=pd.read_csv('/content/drive/MyDrive/transactions_test.csv')

In [ ]:
test
X_test=test.drop(['client_id'],axis='columns')

In [ ]:
X

          trans_date  small_group  amount_rur
0                  6            4      71.463
1                  6           35      45.017
2                  8           11      13.887
3                  9           11      15.983
4                 10           11      21.341
...              ...          ...         ...
26450572         727           25       7.602
26450573         727           15       3.709
26450574         727            1       6.448
26450575         727           11      24.669
26450576         729            3      19.408

[26450577 rows x 3 columns]

In [ ]:
X_test

          trans_date  small_group  amount_rur
0                  3            0      19.555
1                  3            1      27.774
2                  4            0      18.114
3                  4            1      22.183
4                  5            2      45.795
...              ...          ...         ...
17667323         727            1      21.824
17667324         728           36      84.900
17667325         728            3       2.748
17667326         728            1      47.369
17667327         729            3       4.579

[17667328 rows x 3 columns]

In [ ]:
pred=model.predict(X_test)

In [ ]:
pred